In [4]:
import pandas as pd

df=pd.read_csv('/Users/zijian/Public/code_p/num_pan_mat/data/employees.csv')
print(type(df))
print('---------')
print(df.head())
print('---------')
print(df.salary.mean())
print('---------')

<class 'pandas.core.frame.DataFrame'>
---------
   employee_id first_name last_name     email  phone_number   job_id   salary  \
0          100     Steven      King     SKING  515.123.4567  AD_PRES  24000.0
1          101      N_ann   Kochhar  NKOCHHAR  515.123.4568    AD_VP  17000.0
2          102        Lex   De Haan   LDEHAAN  515.123.4569    AD_VP  17000.0
3          103  Alexander    Hunold   AHUNOLD  590.423.4567  IT_PROG   9000.0
4          104      Bruce     Ernst    BERNST  590.423.4568  IT_PROG   6000.0

   commission_pct  manager_id  department_id
0             NaN         NaN           90.0
1             NaN       100.0           90.0
2             NaN       100.0           90.0
3             NaN       102.0           60.0
4             NaN       103.0           60.0
---------
6461.682242990654
---------

In [11]:
df=df.tail()
df.to_csv('data/new.csv')

In [13]:
df=pd.read_json('/Users/zijian/Public/code_p/num_pan_mat/data/data1.json')
df

   id name  age
0   1   张三   25
1   2   李四   30
2   3   王五   28

In [14]:
import json
with open('/Users/zijian/Public/code_p/num_pan_mat/data/test.json') as f:
    data = json.load(f)

{'users': [{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]}

In [20]:
print(type(data))
print(data)
print(type(data['users']))
print(data['users'])

<class 'dict'>
{'users': [{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]}
<class 'list'>
[{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]

In [16]:
df=pd.DataFrame(data['users'])

In [17]:
df

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

In [21]:
# 缺失值处理
import numpy as np

s=pd.Series([1,2,np.nan,None,pd.NA])
print(s)

0       1
1       2
2     NaN
3    None
4    <NA>
dtype: object

In [22]:
print(s.isna())

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [23]:
print(s.isnull())

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [27]:
df=pd.DataFrame([[1,pd.NA,2],[2,3,5],[None,4,6]],columns=['A','B','C'])
print(df)

     A     B  C
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6

In [28]:
print(df.isna())

       A      B      C
0  False   True  False
1  False  False  False
2   True  False  False

In [30]:
print(df.isnull())

<bound method DataFrame.sum of        A      B      C
0  False   True  False
1  False  False  False
2   True  False  False>

In [31]:
print(df.isna().sum())
print(df.isnull().sum())

A    1
B    1
C    0
dtype: int64
A    1
B    1
C    0
dtype: int64

In [32]:
#剔除缺失值
print(s.dropna())

0    1
1    2
dtype: object

In [35]:
print(df)
df.dropna() #一整条记录全删除

     A     B  C
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6

     A  B  C
1  2.0  3  5

In [36]:
print(df.dropna(how='all')) #如果全都有才删除

     A     B  C
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6

In [37]:
print(df.dropna(thresh=1)) #如果至少有n个值不是缺失值

     A     B  C
0  1.0  <NA>  2
1  2.0     3  5
2  NaN     4  6

In [38]:
print(df.dropna(axis=1)) #剔除一整列

   C
0  2
1  5
2  6

In [39]:
print(df.dropna(subset=['A']))

     A     B  C
0  1.0  <NA>  2
1  2.0     3  5

In [40]:
#填充缺失值
df=pd.read_csv('/Users/zijian/Public/code_p/num_pan_mat/data/weather_withna.csv')
df.tail()

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            NaN       NaN       NaN   NaN     NaN
1457  2015-12-28            NaN       NaN       NaN   NaN     NaN
1458  2015-12-29            NaN       NaN       NaN   NaN     NaN
1459  2015-12-30            NaN       NaN       NaN   NaN     NaN
1460  2015-12-31           20.6      12.2       5.0   3.8    rain

In [44]:
print(df.isna().sum(axis=0))

date               0
precipitation    303
temp_max         303
temp_min         303
wind             303
weather          303
dtype: int64

In [47]:
print(df.fillna({'temp_max':20,'wind':2.5}).tail())#使用字典填充

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            NaN      20.0       NaN   2.5     NaN
1457  2015-12-28            NaN      20.0       NaN   2.5     NaN
1458  2015-12-29            NaN      20.0       NaN   2.5     NaN
1459  2015-12-30            NaN      20.0       NaN   2.5     NaN
1460  2015-12-31           20.6      12.2       5.0   3.8    rain

In [52]:
print(df.fillna(df[['wind']].mean()).tail())
print(df.head())

            date  precipitation  temp_max  temp_min      wind weather
1456  2015-12-27            NaN       NaN       NaN  3.242055     NaN
1457  2015-12-28            NaN       NaN       NaN  3.242055     NaN
1458  2015-12-29            NaN       NaN       NaN  3.242055     NaN
1459  2015-12-30            NaN       NaN       NaN  3.242055     NaN
1460  2015-12-31           20.6      12.2       5.0  3.800000    rain
         date  precipitation  temp_max  temp_min  wind  weather
0  2012-01-01            0.0      12.8       5.0   4.7  drizzle
1  2012-01-02           10.9      10.6       2.8   4.5     rain
2  2012-01-03            0.8      11.7       7.2   2.3     rain
3  2012-01-04           20.3      12.2       5.6   4.7     rain
4  2012-01-05            1.3       8.9       2.8   6.1     rain

In [53]:
print(df.ffill().tail())# 用前面的值

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            0.0      11.1       4.4   4.8     sun
1457  2015-12-28            0.0      11.1       4.4   4.8     sun
1458  2015-12-29            0.0      11.1       4.4   4.8     sun
1459  2015-12-30            0.0      11.1       4.4   4.8     sun
1460  2015-12-31           20.6      12.2       5.0   3.8    rain

In [50]:
print(df.bfill().tail())# 用后面的相邻值

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27           20.6      12.2       5.0   3.8    rain
1457  2015-12-28           20.6      12.2       5.0   3.8    rain
1458  2015-12-29           20.6      12.2       5.0   3.8    rain
1459  2015-12-30           20.6      12.2       5.0   3.8    rain
1460  2015-12-31           20.6      12.2       5.0   3.8    rain

In [54]:
data={
    'name':['alice','alice','bob','alice','jack','bob'],
    'age':[26,25,30,25,35,30],
    'city':['NY','NY','LA','NY','SF','LA'],
}
df=pd.DataFrame(data)

In [55]:
df

    name  age city
0  alice   26   NY
1  alice   25   NY
2    bob   30   LA
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [56]:
df.duplicated()#一整条都一样

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [57]:
df.drop_duplicates()

    name  age city
0  alice   26   NY
1  alice   25   NY
2    bob   30   LA
4   jack   35   SF

In [58]:
df.drop_duplicates(subset=['name'])#根据指定列去重

    name  age city
0  alice   26   NY
2    bob   30   LA
4   jack   35   SF

In [59]:
df.drop_duplicates(subset=['name'],keep='last')#保留最后一次出现的行

    name  age city
3  alice   25   NY
4   jack   35   SF
5    bob   30   LA

In [61]:
#数据类型转换
df=pd.read_csv('/Users/zijian/Public/code_p/num_pan_mat/data/sleep.csv')
df

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps,sleep_disorder
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539,NaN
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754,NaN
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857,NaN
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886,NaN
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945,Insomnia
...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,396,Female,36,Student,4.5,7.9,73,7,Normal,118/66,64,14497,Sleep Apnea
396,397,Female,45,Manual Labor,6.0,6.1,72,8,Obese,132/80,65,12848,Insomnia
397,398,Female,30,Student,5.3,6.5,58,10,Obese,125/76,66,15255,Insomnia
398,399,Female,41,Retired,11.0,9.1,73,9,Obese,130/75,75,6567,Sleep Apnea
399,400,Male,37,Retired,5.8,7.0,41,6,Normal,118/70,51,18079,NaN

In [62]:
df.dtypes

person_id                    int64
gender                      object
age                          int64
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
dtype: object

In [63]:
df.age=df.age.astype('int16')

In [64]:
df.dtypes

person_id                    int64
gender                      object
age                          int16
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
dtype: object

In [65]:
df.gender

0        Male
1      Female
2        Male
3        Male
4        Male
        ...
395    Female
396    Female
397    Female
398    Female
399      Male
Name: gender, Length: 400, dtype: object

In [66]:
df.gender=df.gender.astype('category')
df.dtypes

person_id                     int64
gender                     category
age                           int16
occupation                   object
sleep_duration              float64
sleep_quality               float64
physical_activity_level       int64
stress_level                  int64
bmi_category                 object
blood_pressure               object
heart_rate                    int64
daily_steps                   int64
sleep_disorder               object
dtype: object

In [67]:
df.gender

0        Male
1      Female
2        Male
3        Male
4        Male
        ...
395    Female
396    Female
397    Female
398    Female
399      Male
Name: gender, Length: 400, dtype: category
Categories (2, object): ['Female', 'Male']

In [69]:
df['is_male']=df['gender'].map({'Male':True,'Female':False})
df.is_male

0       True
1      False
2       True
3       True
4       True
       ...
395    False
396    False
397    False
398    False
399     True
Name: is_male, Length: 400, dtype: category
Categories (2, bool): [False, True]

In [70]:
#数据变形
import pandas as pd
data={
    'ID':[1,2],
    'name':['Alice','Bob'],
    'Math':[90,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)
df

   ID   name  Math  English  Science
0   1  Alice    90       88       95
1   2    Bob    85       92       89

In [79]:
df2=pd.melt(df,id_vars=['ID','name'],var_name='科目',value_name='分数')#宽表-》长表
df2

   ID   name       科目  分数
0   1  Alice     Math  90
1   2    Bob     Math  85
2   1  Alice  English  88
3   2    Bob  English  92
4   1  Alice  Science  95
5   2    Bob  Science  89

In [78]:
pd.pivot(df2,index=['ID','name'],columns='科目',values='分数')

科目        English  Math  Science
ID name
1  Alice       88    90       95
2  Bob         92    85       89

In [82]:
data={
    'ID':[1,2],
    'name':['Alice smith','Bob smith'],
    'Math':[90,85],
    'English':[88,92],
    'Science':[95,89]
}
df=pd.DataFrame(data)

df[['first','last']]=df['name'].str.split(' ',expand=True)
df

   ID         name  Math  English  Science  first   last
0   1  Alice smith    90       88       95  Alice  smith
1   2    Bob smith    85       92       89    Bob  smith

In [84]:
df=pd.read_csv('/Users/zijian/Public/code_p/num_pan_mat/data/sleep.csv')

df[['high','low']]=df['blood_pressure'].str.split('/',expand=True)

In [91]:
df.tail()
df['high']=df['high'].astype('int16')
df['low']=df['low'].astype('int16')

In [92]:
df.dtypes

person_id                    int64
gender                      object
age                          int64
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
high                         int16
low                          int16
dtype: object

In [101]:
df=pd.read_csv('/Users/zijian/Public/code_p/num_pan_mat/data/employees.csv')
df1=df[['employee_id','salary']]
df1=df1.head(10)

In [102]:
pd.cut(df1['salary'],bins=2)# bins=n, 分成n段区间, 起始值，结束值是所有数据的最小值和最大值

0    (14100.0, 24000.0]
1    (14100.0, 24000.0]
2    (14100.0, 24000.0]
3     (4180.2, 14100.0]
4     (4180.2, 14100.0]
5     (4180.2, 14100.0]
6     (4180.2, 14100.0]
7     (4180.2, 14100.0]
8     (4180.2, 14100.0]
9     (4180.2, 14100.0]
Name: salary, dtype: category
Categories (2, interval[float64, right]): [(4180.2, 14100.0] < (14100.0, 24000.0]]

In [103]:
pd.cut(df1['salary'],bins=2).value_counts()

salary
(4180.2, 14100.0]     7
(14100.0, 24000.0]    3
Name: count, dtype: int64

In [109]:
df1['指标']=pd.cut(df1['salary'],bins=[0,10000,20000,30000],labels=['low','medium','high'])
df1

   employee_id   salary      指标
0          100  24000.0    high
1          101  17000.0  medium
2          102  17000.0  medium
3          103   9000.0     low
4          104   6000.0     low
5          105   4800.0     low
6          106   4800.0     low
7          107   4200.0     low
8          108  12000.0  medium
9          109   9000.0     low

In [105]:
pd.cut(df1['salary'],bins=[0,10000,20000,30000]).value_counts()

salary
(0, 10000]        6
(10000, 20000]    3
(20000, 30000]    1
Name: count, dtype: int64

In [110]:
pd.qcut(df1['salary'],q=3)#人数相等划分区间

0    (12000.0, 24000.0]
1    (12000.0, 24000.0]
2    (12000.0, 24000.0]
3     (6000.0, 12000.0]
4     (6000.0, 12000.0]
5    (4199.999, 6000.0]
6    (4199.999, 6000.0]
7    (4199.999, 6000.0]
8    (12000.0, 24000.0]
9     (6000.0, 12000.0]
Name: salary, dtype: category
Categories (3, interval[float64, right]): [(4199.999, 6000.0] < (6000.0, 12000.0] < (12000.0, 24000.0]]

In [112]:
#睡眠质量
df=pd.read_csv('/Users/zijian/Public/code_p/num_pan_mat/data/sleep.csv')
df1=df.head(10)[['person_id','sleep_quality']]
df1

   person_id  sleep_quality
0          1            7.0
1          2            4.9
2          3            6.0
3          4           10.0
4          5            9.5
5          6            6.9
6          7            6.1
7          8            6.2
8          9            7.2
9         10            4.0

In [115]:
df['睡眠质量']=pd.cut(df['sleep_quality'],bins=3,labels=['low','medium','high'])
df['睡眠质量'].value_counts()

睡眠质量
medium    206
high      129
low        65
Name: count, dtype: int64

In [117]:
#df.rename set_index reset_index

df=pd.DataFrame({
    'name':['Alice','Bob'],
    'age':[26,25],
    'gender':['female','male'],
})

df

    name  age  gender
0  Alice   26  female
1    Bob   25    male

In [118]:
df.set_index('name',inplace=True)

In [119]:
df

       age  gender
name
Alice   26  female
Bob     25    male

In [120]:
df.reset_index(inplace=True)
df

    name  age  gender
0  Alice   26  female
1    Bob   25    male

In [122]:
df.rename(columns={'age':'年龄'},index={0:4})

    name  年龄  gender
4  Alice  26  female
1    Bob  25    male

In [124]:
df.index=[11,21]#同理df.columns=[....]

In [125]:
df

     name  age  gender
11  Alice   26  female
21    Bob   25    male

In [126]:
#分组聚合 groupby
df=pd.read_csv('/Users/zijian/Public/code_p/num_pan_mat/data/employees.csv')
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [127]:
df=df.dropna(subset=['department_id'])
df['department_id']=df['department_id'].astype('int16')

/var/folders/8v/2v0n4gpd503fy6q0_lyh18gh0000gn/T/ipykernel_95867/2261643221.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['department_id']=df['department_id'].astype('int16')

In [128]:
df.dtypes

employee_id         int64
first_name         object
last_name          object
email              object
phone_number       object
job_id             object
salary            float64
commission_pct    float64
manager_id        float64
department_id       int16
dtype: object

In [130]:
#计算不同部门薪资
df.groupby('department_id').groups#查看分组
df.groupby('department_id').get_group(20)#查看具体值

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
101,201,Michael,Hartstein,MHARTSTE,515.123.5555,MK_MAN,13000.0,NaN,100.0,20
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20

In [133]:
df2=df.groupby('department_id')['salary'].mean()
df2.sort_values(ascending=False)

department_id
90     19333.333333
110    10150.000000
70     10000.000000
20      9500.000000
80      8955.882353
100     8600.000000
40      6500.000000
60      5760.000000
10      4400.000000
30      4150.000000
50      3475.555556
Name: salary, dtype: float64

In [134]:
# 多条件分组
df.groupby(['department_id','job_id'])['salary'].mean()

department_id  job_id
10             AD_ASST        4400.000000
20             MK_MAN        13000.000000
               MK_REP         6000.000000
30             PU_CLERK       2780.000000
               PU_MAN        11000.000000
40             HR_REP         6500.000000
50             SH_CLERK       3215.000000
               ST_CLERK       2785.000000
               ST_MAN         7280.000000
60             IT_PROG        5760.000000
70             PR_REP        10000.000000
80             SA_MAN        12200.000000
               SA_REP         8396.551724
90             AD_PRES       24000.000000
               AD_VP         17000.000000
100            FI_ACCOUNT     7920.000000
               FI_MGR        12000.000000
110            AC_ACCOUNT     8300.000000
               AC_MGR        12000.000000
Name: salary, dtype: float64